[    
    {
        "organisation": "Cyberschool",
        "job": "4th place",
        "from": "2010",
        "to": "",
        "shortDescription": "4th place in the Cyberschool finals 2010.",
        "technologies": [],
        "type": "award",
        "content": []
    },
    {
        "organisation": "Jungend Informatik",
        "job": "2nd place",
        "from": "2010",
        "to": "",
        "shortDescription": "2nd place at the 27th Austrian 'Jugend Informatik' competition.",
        "technologies": [],
        "type": "award",
        "content": []
    },
    {
        "organisation": "MRM-Systems",
        "job": "Fullstack Developer",
        "from": "10/2011",
        "to": "02/2013",
        "shortDescription": "Development of the webbased App.",
        "technologies": ["JS (dojo)", "PHP (CakePHP)", "MSSQL", "MySQL"],
        "type": "work",
        "content": [
            "Working on the company’s own software ERP solution to ensure good quality in automated factories (specialized on liquids). First I mainly worked on the backend (PHP - CakePHP) and then switched to frontend (JS - Dojo).",
            "I managed the network, servers and firewalls of the company. The office ressources like E-Mail and homepage were provided by myself.",
            "Creating database concepts and implementing them was a part of my job."
        ]
    },
    {
        "organisation": "proMESdata",
        "job": "Fullstack Developer",
        "from": "03/2013",
        "to": "11/2014",
        "shortDescription": "Developing the front- and backend App",
        "technologies": ["JS (dojo)", "PHP (CakePHP)", "MSSQL", "MySQL"],
        "type": "work",
        "content": [
            "Working on the company’s own software ERP solution to ensure good quality in automated factories (specialized on liquids). First I mainly worked on the backend (PHP - CakePHP) and then switched to frontend (JS - Dojo).",
            "Creating database concepts and implementing them was a part of my job.",
            "I have been in charge of new customers and have had to lead these ongoing projects. Installations of the software on site (Switzerland) and training the key users was also a part of my job.",
            "I made school enrollment of new members of the team."
        ]
    },
    {
        "organisation": "TUNNEL23",
        "job": "Fullstack Developer",
        "from": "12/2014",
        "to": "10/2018",
        "shortDescription": "Developed a automated CMS for ad creation.",
        "technologies": ["JS (jQuery, Vue)", "PHP (Laravel)", "MySQL"],
        "type": "work",
        "content": [
            "Working on the company's CMS software to automatically generate ads. I completely reworked the software with Vue.js and PHP (Laravel).",
            "One of my key parts was to develop and experiment with new technologies and new ways to display mobile ads.",
            "I designed and implemented database concepts.",
            "The care and maintenance of our company websites with different tools was also a small part of my business.",
            "I created responsive landing pages, templates, prototypes and all kinds of web tools for internal use."
        ]
    },
    {
        "organisation": "IAB webAD",
        "job": "Young talent",
        "from": "2017",
        "to": "",
        "shortDescription": "Awarded for the young talent.",
        "technologies": [],
        "type": "award",
        "content": []
    },
    {
        "organisation": "IAB webAD",
        "job": "iab webAD Jury Member",
        "from": "2018",
        "to": "",
        "shortDescription": "Member of the jury for the best ad's.",
        "technologies": [],
        "type": "award",
        "content": []
    },
    {
        "organisation": "RIBSAA",
        "job": "Fullstack Developer",
        "from": "20/05/2018",
        "to": "today",
        "shortDescription": "Develop international used framework features.",
        "technologies": ["JS (TS, AngularJs, Angular)", "C#", "MSSQL"],
        "type": "work",
        "content": [
            "Working on the ERP software iTWO4.0 as frontend-developer (AngularJS) and part time backend-developer (C#).",
            "Design strategies to migrate from AngularJS to Angular as a core team member of the RIB developer team in Stuttgart. ",
            "In my current position I have to make system relevant software architectural decisions.",
            "My main responsibility is to provide clean and solid Framework features which are used by all developers around the world (China, USA, Germany, India). One of my most important part is the so called “Planning Board” to visualize data in a more user friendly way. This is done with D3JS (data driven JS library).",
            "Refactoring and performance orientated development are very important parts of my current position.",
            "To reduce manual testing I also write automated E2E and unit tests with Jest, Storybook and Protractor.",
            "Another part of my current position is to grant optimized deployable code. I use gulp and its pipes to ensure the best possible build and bundling outcome.",
            "As an assistant of our parent company RIB, I use my long time experience to deliver UI / UX - concepts and their implementation.",
            "In our team in Vienna I am the Scrummaster and support our product owner and plan our agile planned sprints. I also teach and look after our junior developer. Code reviews(PR), teaching development concepts and guide colleges are my daily business."
        ]
    },
    {
        "organisation": "RIBSAA",
        "job": "Technical Architect",
        "from": "01/12/2021",
        "to": "today",
        "shortDescription": "Part of an international Architects team.",
        "technologies": ["JS (TS, Angular, React)", "C#", "MSSQL", "Azure DevOps"],
        "type": "work",
        "content": [
            "Frontend Architect of an Micro-Frontend (MFE - with module-federation) Angular Applikation.", 
            "Leading and guiding international teams.",
            "Part of an Angular migration Team which migrates an enterprise application from AngularJS to Angular. Defining styleguides, dependencies and directory structures are parts of my responsibility.",
            "Evaluation and writing guidelines for all products of the RIB Group is also part of my job as a technical architect",
            "I am also responsible for used technologies and tools especially in the frontend sector."
        ]
    }
]